config/packages.org
#+title: Doom Emacs > Packages
#+language: en
#+property: header-args :tangle ../packages.el

* General
#+begin_src emacs-lisp
(package! super-save) ;; Package repository: [[https://github.com/bbatsov/super-save][here]].
#+end_src

* Look and Feel
#+begin_src emacs-lisp
;(package! auto-dark)
(package! resize-window)
(package! centered-cursor-mode)
(package! defrepeater)
#+end_src

* Project Management
#+begin_src emacs-lisp
(package! consult-projectile)
(package! treemacs-projectile)
(package! ranger)
(package! run-command)
#+end_src

* Version Control
#+begin_src emacs-lisp
(package! browse-at-remote)
(package! diff-hl)
(package! magit-todos)

;; required to workaround magit issue
(package! closql :pin "0a7226331ff1f96142199915c0ac7940bac4afdd")
#+end_src

* Coding
#+begin_src emacs-lisp
;(package! expand-region) ;; See repository [[https://github.com/magnars/expand-region.el][here]].
(package! rainbow-delimiters)
(package! consult-yasnippet) ;; Consult integration with yasnippet:
(package! devdocs)
;(package! better-jumper)
(package! flycheck-phpstan)
(package! psysh)
(package! php-doc-block :recipe (:host github :repo "moskalyovd/emacs-php-doc-block"))
#+end_src

* Keybindings
#+begin_src emacs-lisp
;(package! evil-snipe :disable t) ;; Search in buffer:
(package! evil-nerd-commenter)
(package! move-text)
#+end_src

* Org Everything
#+begin_src emacs-lisp
(package! org-modern)
(package! org-auto-tangle)
;; (package! inf-ruby)
;(package! ob-async)
;(package! ob-http)
(package! consult-org-roam)
(package! org-bullets)
(package! toc-org)
;(package! literate-calc-mode)
(package! ox-slack)
#+end_src
* Writing
#+begin_src emacs-lisp
(package! spell-fu)
(package! consult-notes)
#+end_src

* Other
#+begin_src emacs-lisp
(package! keyfreq)
(package! elfeed)
(package! elfeed-goodies)
(package! speed-type)
(package! shut-up)
(package! hide-mode-line)
(package! affe)

#+end_src
