packages.el
(package! super-save) ;; Package repository: [[https://github.com/bbatsov/super-save][here]].

(package! auto-dark)
(package! resize-window)
(package! centered-cursor-mode)
(package! defrepeater)

(package! consult-projectile)
(package! treemacs-projectile)
(package! ranger)

(package! browse-at-remote)

(package! expand-region) ;; See repository [[https://github.com/magnars/expand-region.el][here]].
(package! rainbow-delimiters)
(package! consult-yasnippet) ;; Consult integration with yasnippet:
(package! devdocs)
(package! better-jumper)

(package! evil-snipe :disable t) ;; Search in buffer:
(package! evil-nerd-commenter)
(package! move-text)

(package! org-modern)
(package! org-auto-tangle)
(package! inf-ruby)
(package! ob-async)
(package! ob-http)
(package! consult-org-roam)
(package! org-bullets)
(package! toc-org)
(package! literate-calc-mode)
(package! ox-slack)

(package! keyfreq)
(package! elfeed)
(package! elfeed-goodies)
